# Олимпиадалық есептер және алгоритмдік ойлау

print("1-есеп. Екі санның қосындысы")
a = int(input("Бірінші сан: "))
b = int(input("Екінші сан: "))
print("Қосынды =", a + b)

print("\n2-есеп. Санның жұп немесе тақ екенін анықтау")
n = int(input("Сан енгізіңіз: "))
if n % 2 == 0:
    print("Жұп сан")
else:
    print("Тақ сан")

print("\n3-есеп. Үш санның ең үлкенін табу")
x = int(input("Бірінші сан: "))
y = int(input("Екінші сан: "))
z = int(input("Үшінші сан: "))
print("Ең үлкен сан =", max(x, y, z))

print("\n4-есеп. Цифрлар қосындысы")
num = int(input("Сан енгізіңіз: "))
s = 0
temp = num

while temp > 0:
    s += temp % 10
    temp //= 10

print("Цифрлар қосындысы =", s)

print("\n5-есеп. Жолды кері шығару")
text = input("Мәтін енгізіңіз: ")
print("Кері жазылуы =", text[::-1])